"""
    突发奇想的小巧思。虽然很基础，但是很有趣。
    例如：
"""
var = 100
if var == 100:
    print("太好啦，是烧鸡，我们没救了！")
    print("心还没有悬着就去世了！")

# 掺了点蛊
gu_real_person = '大专巅峰'
if gu_real_person == '大专巅峰':
    print("“你到底干了什么，你不跟我们干，我们以后怎么赚大钱”室友跺着脚恶狠狠地瞪着他。")
    print("他淡然一笑“很简单，我进厂不就是了”说完，他的气息不再掩饰，显露而出，大专巅峰！！一瞬间，流水线再次一寂。")
    print("我乃大专巅峰！何人敢叼我，何人能叼我！他口中低吟道：")
    print("电子厂中寒风吹，流水线上大神归")
    print("一号工位黑奴泪，褪去校服人向北")
    print("无休倒班万人退，三千工资空落泪")
    print("宿命天成当厂妹，本科悔而我不悔!")
    print("早岁已知挣钱艰，仍许资本荡人间")
    print("十年苦读身如絮，无尘车间客独行")
    print("千磨万击手铸铁，殚精竭虑打工件")
    print("今朝人向工位处，打件打人还打天")
    print("从今以后，他就彻底从一位学生变成一位打工人，可以堂堂正正的打螺丝，造福车间了，工友们的历史，资本家们的历史不得不记载他的名字，至此他和数百位工友并肩，宛若大日光照千古，其余同学无论多么豪杰英雄，皆为繁星。")
college_students = '发言'
if college_students == '发言':
    print('不过是些许风霜罢了')
    print('面对凶险万分的流水线，不退反进，仰天大喝：件来！')
    print('今朝剑指叠云处，炼蛊炼人还炼天')
print('今朝剑指叠云处，炼蛊炼人还炼天')

# 变量设定挺随意的，对吧~
apple = 'eat'
kill = 'eat'
i = 'you'
kiss = 'you'

# 检查条件是否满足，经典语句
if (apple == kill) and (i == kiss):
    print('一袋米要抗几楼（感受痛苦吧），')
    print('一袋米要抗二楼（思考痛苦吧），')
    print('一袋米要给多了（接受痛苦吧），')
    print('一袋米我洗嘞（理解痛苦吧），')
    print('一袋米我洗了那么多泥（不了解痛楚的人），')
    print('和那堆黑瓦，瓦坷垃（是无法了解真正的和平的）！')
    print('颗颗有泥（从现在开始），')
    print('谁给你一袋米呦（让世界感受痛苦），')
    print('行了添水/辛辣天森/心累天塞（神罗天征）！')
elif (apple == kill) and (i != kiss):
    print('一袋米引发的战争')
'''试了三次啊，三次，终于成功了'''


